
export default [
  {
    "content": "DeepSeek 入门\n\n## 1. 提示词策略差异",
    "title": "AI 提示词入门",
    "date": "2025-05-01T21:10:00+08:00",
    "updated": "2025-05-01T21:10:00+08:00",
    "featured": true,
    "summary": "这是一个 AI 提示词教程 本文会介绍一些大模型提示词的基本知识",
    "keywords": [
      "AI",
      "提示词"
    ],
    "_meta": {
      "filePath": "ai-prompt-intro-1.md",
      "fileName": "ai-prompt-intro-1.md",
      "directory": ".",
      "extension": "md",
      "path": "ai-prompt-intro-1"
    },
    "slug": "ai-prompt-intro-1"
  },
  {
    "content": "区块链介绍",
    "title": "Web3 入门教程",
    "date": "2025-07-01T21:10:00+08:00",
    "updated": "2025-07-01T21:10:00+08:00",
    "featured": true,
    "summary": "这是一个 Web3入门教程 本文会介绍一些web3的基本知识",
    "keywords": [
      "Web3",
      "区块链",
      "智能合约",
      "去中心化"
    ],
    "_meta": {
      "filePath": "web3-base-blockchain-concept.md",
      "fileName": "web3-base-blockchain-concept.md",
      "directory": ".",
      "extension": "md",
      "path": "web3-base-blockchain-concept"
    },
    "slug": "web3-base-blockchain-concept"
  },
  {
    "content": "web3 介绍\n\nWeb2 指的是如今我们众所周知的互联网版本。 互联网由互联公司掌控，它们通过提供服务来换取个人数据。 Web3 指的是在区块链上运行的去中心化应用程序。 任何用户都可以参与这些应用程序，而无需出卖个人数据。\n\n\n## 一、Web3 的优势\n\n许多 Web3 开发者由于以太坊与生俱来的去中心化而选择构建去中心化应用程序：\n\n- 网络上的任何人都有使用服务的权限 – 换言之，不需要授予权限。\n- 没有人可以阻止或拒绝你访问服务。\n- 付款是通过原生代币以太币 (ETH) 构建的。\n- 以太坊是图灵完备的，这意味着你几乎可以进行任何编程。\n\n## 二、Web3 的劣势\n\n\n- 可扩展性——交易在 web3 上进度较慢，因为它们是去中心化的。 状态变化（例如支付）需要由节点处理并在整个网络中传播。\n- UX – 与 Web3 应用程序交互可能需要额外的步骤、软件和培训。 这可能是应用的一个障碍。\n- 可访问性 – 由于在现代 Web 浏览器中的集成不够，致使大多数用户无法访问 Web3。\n- 成本 – 因为成本高昂，大多数成功的去中心化应用程序仅将其代码的很小一部分放到区块链上。\n\n\n## 三、web2 与 web3 比较\n\n| web2 | web3 | \n|---------|---------|\n| Twitter 可以检查任何帐户或推文  | Web3 推文不可审查，因为控制已经去中心化  | \n| 支付服务可以决定不允许对某些类型的工作进行支付  | Web3 付款应用程序不需要个人数据，也不能阻止付款  | \n| 运行零工经济应用程序的服务器可能会停机，影响劳动者收入  | Web3 服务器不会停机 – 它们的后端是以太坊，一个由数以千计的计算机组成的去中心化网络  | \n\n\n## 四、中心化与去中心化\n\n| 中心化系统 | 去中心化系统 | \n|---------|---------|\n| 网络半径短（所有参与者都与中心化组织连接）； 信息传递快，因为是由一个拥有大量计算资源的中心化组织处理的。 | 网络上最远的参与者可能彼此相距甚远。 网络中一方的信息广播可能需要很长时间才能传达给另一方。  | \n| 性能通常较高（吞吐量较高、总计算资源消耗较少）以及构建较为容易。 | 性能通常较低（吞吐量较低，总计算资源消耗较高），构建起来更为复杂。  | \n| 在出现相互冲突的数据时，解决办法明确且简单：最终信任的数据来源是中心化组织。 | 解决争端需要一项协议（通常是复杂的协议）。 如果其他参与者对参与者打算同步的数据状态提出相互冲突的主张。  | \n| 单点故障：恶意行为者可能能够以中心化组织为目标来破坏网络。| 无单点故障：即使有很大比例的参与者受到攻击或下线，网络仍然可以运作。 ｜\n| 参与者之间的协调要容易得多，由中心化组织负责。 中心化组织可以迫使网络参与者接受升级、更新协议等，阻力较小。| 协调往往很困难，因为没有任何单一角色在网络级的决策、协议升级等方面拥有最终发言权。 在最糟糕的情况下，当对协议更改有分歧时，网络容易破裂。| \n| 中心化组织可以审查数据，可能会切断网络的某些部分与网络其他部分的交互。| 审查制度要困难得多，因为信息有多种途径在网络上传播。| \n| 网络准入由中心化组织控制。| 任何人都可以加入网络；没有“守门人”。 理想的情况是，参与费用非常低。| \n\n\n请注意，这些都是一般概况，可能不适用于每一个网络。 此外，在现实情况下，网络中心化/去中心化程度取决于一系列因素；没有一个网络完全中心化或完全去中心化。",
    "title": "Web3入门教程-web3 概念",
    "date": "2025-03-01T21:10:00+08:00",
    "updated": "2025-03-01T21:10:00+08:00",
    "featured": true,
    "summary": "这是一个 Web3入门教程 本文会介绍一些web3的基本知识",
    "keywords": [
      "Web3",
      "区块链",
      "智能合约",
      "去中心化"
    ],
    "_meta": {
      "filePath": "web3-base-web3-concept.md",
      "fileName": "web3-base-web3-concept.md",
      "directory": ".",
      "extension": "md",
      "path": "web3-base-web3-concept"
    },
    "slug": "web3-base-web3-concept"
  }
]